
/**

//══════════════════════════════════════════════════════════════════════════════\\
//                                                                                            \\
//          ██████╗  █████╗ ██╗  ██╗██╗   ██╗██╗         ███╗   ███╗██████╗            \\
//          ██╔══██╗██╔══██╗██║  ██║██║   ██║██║         ████╗ ████║██╔══██╗          \\
//          ██████╔╝███████║███████║██║   ██║██║         ██╔████╔██║██║  ██║          \\
//          ██╔══██╗██╔══██║██╔══██║██║   ██║██║         ██║╚██╔╝██║██║  ██║          \\
//          ██║  ██║██║  ██║██║  ██║╚██████╔╝███████╗    ██║ ╚═╝ ██║██████╔╝          \\
//          ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚══════╝    ╚═╝     ╚═╝╚═════╝            \\
//                                                                                             \\
//═══════════════════════════════════════════════════════════════════════════════\\

   * @Project_Name : Rahul-Md
   * @author : Rahul Tech Ser
   * @youtube : https://youtube.com/@rahultech009
   * @description : Rahul-Md ,A Multi-functional whatsapp user bot.
   * @version : V1
*
* 
   * Created By Rahul Debnath.
   * © 2024 Rahul-Md.
*/



const _0x1e88ff=_0x1f98;function _0x59d6(){const _0x3406e9=['main','1541036PhHcWE','https://files.catbox.moe/swo0mx.jpg','sendMessage','4111260RJnRFT','1600764BnWrku','../command','75896YNEQoh','❁\x20════\x20❃•◯•❃\x20════\x20❁\x0a\x0a*⇆\x20ʜʏᴇ\x20ᴍʏ\x20ᴅᴇᴀʀ\x20ғʀɪᴇɴᴅ\x20⇆*\x0a\x0a\x20\x20\x20\x20\x20_','log','2879444TfQSrb','4441315OPIpXe','get\x20owner\x20number','bot','rahul','1541323TiMfYE','6ZhdpbI','_\x0a\x0a❁\x20════\x20❃•◯•❃\x20════\x20❁\x0a\x0a*ʜᴇʀᴇ\x20ɪs\x20ʙᴏᴛ\x20ᴏᴡɴᴇʀ\x20ɪɴғᴏ*\x0a\x0a⇩━━━━━━━━❁━━━━━━━━⇩\x0a┝\x20*ɴᴀᴍᴇ:*\x20*ʀᴀʜᴜʟ\x20ᴅᴇʙɴᴀᴛʜ*\x0a┝\x20*ᴘᴜʙʟɪᴄ\x20ɴᴀᴍᴇ:*\x20*ʀᴀʜᴜʟ\x20ᴛᴇᴄʜ\x20sᴇʀ*\x0a┝\x20*ɴɪᴄᴋ\x20ɴᴀᴍᴇ:*\x20*Ř\u3000Å\u3000H\u3000Ü\u3000\x20L\u3000ツ*\x0a┝\x20*ᴀɢᴇ:*\x20*17*\x0a┝\x20*ғᴀᴠᴏʀɪᴛᴇ\x20ᴄᴏʟᴏʀ:*\x20*ʙʟᴀᴄᴋ*\x0a┝\x20*ғᴀᴠᴏʀɪᴛᴇ\x20ᴀᴘᴘ:*\x20*ᴡʜᴀᴛsᴀᴘᴘ*\x0a┝\x20*ᴄᴏɴᴛᴀᴄᴛ*\x20*wa.me/+919547261290*\x0a┝\x20*ʜᴏʙʙʏ:*\x20*sᴍᴏᴋɪɴɢ\x20🚬,ᴄᴏᴅɪɴɢ\x20🧑🏻‍💻,ᴇᴅɪᴛɪɴɢ\x20🎨*\x0a❁\x20════\x20❃•⇆•❃\x20════\x20❁\x0a\x0a>\x20*©\x20RAHUL\x20TECH\x20SER*\x0a\x0a╰━❁\x20═══\x20❃•⇆•❃\x20═══\x20❁━╯\x0a'];_0x59d6=function(){return _0x3406e9;};return _0x59d6();}(function(_0x29257d,_0x201011){const _0x48d03f=_0x1f98,_0x47ac85=_0x29257d();while(!![]){try{const _0xd4719f=-parseInt(_0x48d03f(0x129))/0x1+-parseInt(_0x48d03f(0x11f))/0x2+-parseInt(_0x48d03f(0x12a))/0x3*(-parseInt(_0x48d03f(0x124))/0x4)+parseInt(_0x48d03f(0x125))/0x5+parseInt(_0x48d03f(0x11e))/0x6+parseInt(_0x48d03f(0x11b))/0x7+-parseInt(_0x48d03f(0x121))/0x8;if(_0xd4719f===_0x201011)break;else _0x47ac85['push'](_0x47ac85['shift']());}catch(_0x387f5c){_0x47ac85['push'](_0x47ac85['shift']());}}}(_0x59d6,0xd75e7));const {readEnv}=require('../lib/database'),{cmd,commands}=require(_0x1e88ff(0x120));function _0x1f98(_0x409f0c,_0x59e406){const _0x59d6f0=_0x59d6();return _0x1f98=function(_0x1f98f2,_0x4ee603){_0x1f98f2=_0x1f98f2-0x119;let _0x1e0b15=_0x59d6f0[_0x1f98f2];return _0x1e0b15;},_0x1f98(_0x409f0c,_0x59e406);}cmd({'pattern':'owner','react':'👑','alias':[_0x1e88ff(0x128),_0x1e88ff(0x127)],'desc':_0x1e88ff(0x126),'category':_0x1e88ff(0x11a),'filename':__filename},async(_0x280fae,_0x5799a0,_0x7881e2,{from:_0x3689f2,quoted:_0x41ada8,body:_0x18b75b,isCmd:_0x1a9ec5,command:_0x414b68,args:_0x58b9d1,q:_0xb94fc5,isGroup:_0x4182c8,sender:_0x168c3a,senderNumber:_0x2da045,botNumber2:_0x4baa02,botNumber:_0x5a2a34,pushname:_0x104e9a,isMe:_0x5543a0,isOwner:_0x1245e0,groupMetadata:_0x319684,groupName:_0x12f03a,participants:_0x2435d8,groupAdmins:_0x4c8785,isBotAdmins:_0x33c5ae,isAdmins:_0x5ce553,reply:_0x1bd140})=>{const _0x3f1de2=_0x1e88ff;try{const _0x18838f=await readEnv();let _0x323b3e=_0x3f1de2(0x122)+_0x104e9a+_0x3f1de2(0x119);await _0x280fae[_0x3f1de2(0x11d)](_0x3689f2,{'image':{'url':_0x3f1de2(0x11c)},'caption':_0x323b3e},{'quoted':_0x5799a0});}catch(_0x12338a){console[_0x3f1de2(0x123)](_0x12338a),_0x1bd140(''+_0x12338a);}});
