
/**

//══════════════════════════════════════════════════════════════════════════════\\
//                                                                                            \\
//          ██████╗  █████╗ ██╗  ██╗██╗   ██╗██╗         ███╗   ███╗██████╗            \\
//          ██╔══██╗██╔══██╗██║  ██║██║   ██║██║         ████╗ ████║██╔══██╗          \\
//          ██████╔╝███████║███████║██║   ██║██║         ██╔████╔██║██║  ██║          \\
//          ██╔══██╗██╔══██║██╔══██║██║   ██║██║         ██║╚██╔╝██║██║  ██║          \\
//          ██║  ██║██║  ██║██║  ██║╚██████╔╝███████╗    ██║ ╚═╝ ██║██████╔╝          \\
//          ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚══════╝    ╚═╝     ╚═╝╚═════╝            \\
//                                                                                             \\
//═══════════════════════════════════════════════════════════════════════════════\\

   * @Project_Name : Rahul-Md
   * @author : Rahul Tech Ser
   * @youtube : https://youtube.com/@rahultech009
   * @description : Rahul-Md ,A Multi-functional whatsapp user bot.
   * @version : V1
*
* 
   * Created By Rahul Debnath.
   * © 2024 Rahul-Md.
*/



const _0x32ffb0=_0x40b0;function _0x40b0(_0x553244,_0x1f88c6){const _0xfaa7d3=_0xfaa7();return _0x40b0=function(_0x40b0b6,_0x4e8f39){_0x40b0b6=_0x40b0b6-0x191;let _0x1d262f=_0xfaa7d3[_0x40b0b6];return _0x1d262f;},_0x40b0(_0x553244,_0x1f88c6);}(function(_0x116a1f,_0x20bbbe){const _0x1c0e40=_0x40b0,_0x106b86=_0x116a1f();while(!![]){try{const _0x581618=-parseInt(_0x1c0e40(0x19d))/0x1+parseInt(_0x1c0e40(0x196))/0x2+parseInt(_0x1c0e40(0x1a1))/0x3*(parseInt(_0x1c0e40(0x1a4))/0x4)+parseInt(_0x1c0e40(0x19e))/0x5*(parseInt(_0x1c0e40(0x198))/0x6)+parseInt(_0x1c0e40(0x191))/0x7+parseInt(_0x1c0e40(0x19b))/0x8*(parseInt(_0x1c0e40(0x1a2))/0x9)+-parseInt(_0x1c0e40(0x193))/0xa;if(_0x581618===_0x20bbbe)break;else _0x106b86['push'](_0x106b86['shift']());}catch(_0x16495f){_0x106b86['push'](_0x106b86['shift']());}}}(_0xfaa7,0x919f7));function _0xfaa7(){const _0x43328e=['8iGHBYq','❁\x20════\x20❃•◯•❃\x20════\x20❁\x0a\x0a*⇆\x20ʜʏᴇ\x20ᴍʏ\x20ᴅᴇᴀʀ\x20ғʀɪᴇɴᴅ\x20⇆*\x0a\x0a\x20\x20\x20\x20\x20*','1129648kQuyec','5JFDsQZ','main','get\x20owner\x20number','3pTgmpn','7235154kwNkoK','sendMessage','939932TozFcm','4404449KPAcBd','bot','2973120qpHytI','../lib/database','../command','19276uUsCdj','ALIVE_IMG','2074182getWfJ','log','*\x0a\x0a❁\x20════\x20❃•◯•❃\x20════\x20❁\x0a\x0a*ʜᴇʀᴇ\x20ɪs\x20ʙᴏᴛ\x20ᴏᴡɴᴇʀ\x20ɪɴғᴏ*\x0a\x0a⇩━━━━━━━━❁━━━━━━━━⇩\x0a┝\x20*ɴᴀᴍᴇ:*\x20*ʀᴀʜᴜʟ\x20ᴅᴇʙɴᴀᴛʜ*\x0a┝\x20*ᴘᴜʙʟɪᴄ\x20ɴᴀᴍᴇ:*\x20*ʀᴀʜᴜʟ\x20ᴛᴇᴄʜ\x20sᴇʀ*\x0a┝\x20*ɴɪᴄᴋ\x20ɴᴀᴍᴇ:*\x20*Ř\u3000Å\u3000H\u3000Ü\u3000\x20L\u3000ツ*\x0a┝\x20*ᴀɢᴇ:*\x20*17*\x0a┝\x20*ғᴀᴠᴏʀɪᴛᴇ\x20ᴄᴏʟᴏʀ:*\x20*ʙʟᴀᴄᴋ*\x0a┝\x20*ғᴀᴠᴏʀɪᴛᴇ\x20ᴀᴘᴘ:*\x20*ᴡʜᴀᴛsᴀᴘᴘ*\x0a┝\x20*ᴄᴏɴᴛᴀᴄᴛ*\x20*wa.me/+919547261290*\x0a┝\x20*ʜᴏʙʙʏ:*\x20*sᴍᴏᴋɪɴɢ\x20🚬,ᴄᴏᴅɪɴɢ\x20🧑🏻‍💻,ᴇᴅɪᴛɪɴɢ\x20🎨*\x0a❁\x20════\x20❃•⇆•❃\x20════\x20❁\x0a\x0a>\x20*©\x20RAHUL\x20TECH\x20SER*\x0a\x0a╰━❁\x20═══\x20❃•⇆•❃\x20═══\x20❁━╯\x0a'];_0xfaa7=function(){return _0x43328e;};return _0xfaa7();}const {readEnv}=require(_0x32ffb0(0x194)),{cmd,commands}=require(_0x32ffb0(0x195));cmd({'pattern':'owner','react':'👑','alias':['rahul',_0x32ffb0(0x192)],'desc':_0x32ffb0(0x1a0),'category':_0x32ffb0(0x19f),'filename':__filename},async(_0x492c63,_0x209156,_0x4ecbc3,{from:_0x28d087,quoted:_0x54aa7a,body:_0x25d990,isCmd:_0x9f8719,command:_0x43afcd,args:_0x520cb8,q:_0x163bbb,isGroup:_0xde0858,sender:_0x17f0b6,senderNumber:_0x19fbe1,botNumber2:_0x11f626,botNumber:_0x2d7de8,pushname:_0xb9fab3,isMe:_0x4451ec,isOwner:_0x1b3b89,groupMetadata:_0x1cb346,groupName:_0x4d046a,participants:_0x405967,groupAdmins:_0x51cb29,isBotAdmins:_0x32fcec,isAdmins:_0x3e7fcb,reply:_0x22e422})=>{const _0x2df05c=_0x32ffb0;try{const _0x21fb04=await readEnv();let _0x3cd8ba=_0x2df05c(0x19c)+_0xb9fab3+_0x2df05c(0x19a);await _0x492c63[_0x2df05c(0x1a3)](_0x28d087,{'image':{'url':_0x21fb04[_0x2df05c(0x197)]},'caption':_0x3cd8ba},{'quoted':_0x209156});}catch(_0x516c63){console[_0x2df05c(0x199)](_0x516c63),_0x22e422(''+_0x516c63);}});
